apache/nuttx/arch/arm/src/stm32h5/stm32_fdcan.c
/****************************************************************************
 * arch/arm/src/stm32h5/stm32_fdcan.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *s
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <errno.h>
#include <nuttx/debug.h>
#include <assert.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/semaphore.h>
#include <nuttx/can/can.h>

#include "arm_internal.h"
#include "stm32_fdcan.h"
#include "hardware/stm32_pinmap.h"
#include "stm32_gpio.h"
#include "stm32_rcc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configure FDCAN TQ Clock *************************************************/

/* Define STM32_FDCAN_PDIV (FDCAN_CKDIV PDIV[3:0] Value) in board.h */

#ifdef STM32_FDCAN_PDIV
#  define FDCANCLK_PDIV              STM32_FDCAN_PDIV
#else
#  define FDCANCLK_PDIV              (0)
#endif

/* Define STM32_FDCAN_FREQUENCY (fdcan_ker_ck) in board.h */

#if FDCANCLK_PDIV == 0
#  define STM32_FDCANCLK_FREQUENCY (STM32_FDCAN_FREQUENCY / (1))
#else
#  define STM32_FDCANCLK_FREQUENCY (STM32_FDCAN_FREQUENCY / (2 * FDCANCLK_PDIV))
#endif

/* General Configuration ****************************************************/

/* FDCAN Message RAM */

#  define FDCAN_MSGRAM_WORDS         (212)
#  define STM32_CANRAM1_BASE         (STM32_FDCAN_SRAM_BASE + 0x0000)
#  define STM32_CANRAM2_BASE         (STM32_FDCAN_SRAM_BASE + 1*(FDCAN_MSGRAM_WORDS * 4))

#  ifdef CONFIG_STM32H5_FDCAN1
#    define FDCAN1_STDFILTER_SIZE    (28)
#    define FDCAN1_EXTFILTER_SIZE    (8)
#    define FDCAN1_RXFIFO0_SIZE      (3)
#    define FDCAN1_RXFIFO1_SIZE      (3)
#    define FDCAN1_TXEVENTFIFO_SIZE  (3)
#    define FDCAN1_TXFIFIOQ_SIZE     (3)

#    define FDCAN1_STDFILTER_WORDS   (28)
#    define FDCAN1_EXTFILTER_WORDS   (16)
#    define FDCAN1_RXFIFO0_WORDS     (54)
#    define FDCAN1_RXFIFO1_WORDS     (54)
#    define FDCAN1_TXEVENTFIFO_WORDS (6)
#    define FDCAN1_TXFIFIOQ_WORDS    (54)
#  endif
#  ifdef CONFIG_STM32H5_FDCAN2
#    define FDCAN2_STDFILTER_SIZE    (28)
#    define FDCAN2_EXTFILTER_SIZE    (8)
#    define FDCAN2_RXFIFO0_SIZE      (3)
#    define FDCAN2_RXFIFO1_SIZE      (3)
#    define FDCAN2_TXEVENTFIFO_SIZE  (3)
#    define FDCAN2_TXFIFIOQ_SIZE     (3)

#    define FDCAN2_STDFILTER_WORDS   (28)
#    define FDCAN2_EXTFILTER_WORDS   (16)
#    define FDCAN2_RXFIFO0_WORDS     (54)
#    define FDCAN2_RXFIFO1_WORDS     (54)
#    define FDCAN2_TXEVENTFIFO_WORDS (6)
#    define FDCAN2_TXFIFIOQ_WORDS    (54)
#  endif

/* FDCAN1 Configuration *****************************************************/

#ifdef CONFIG_STM32H5_FDCAN1

/* Bit timing */

#  ifndef CONFIG_STM32H5_FDCAN1_AUTO_BIT_TIMING

#    define FDCAN1_NTSEG1  (CONFIG_STM32H5_FDCAN1_NTSEG1 - 1)
#    define FDCAN1_NTSEG2  (CONFIG_STM32H5_FDCAN1_NTSEG2 - 1)
#    define FDCAN1_NBRP    ((STM32_FDCANCLK_FREQUENCY /             \
                             ((FDCAN1_NTSEG1 + FDCAN1_NTSEG2 + 3) * \
                              CONFIG_STM32H5_FDCAN1_BITRATE)) - 1)
#    define FDCAN1_NSJW    (CONFIG_STM32H5_FDCAN1_NSJW - 1)

#    if FDCAN1_NTSEG1 > FDCAN_NBTP_NTSEG1_MAX
#      error Invalid FDCAN1 NTSEG1
#    endif
#    if FDCAN1_NTSEG2 > FDCAN_NBTP_NTSEG2_MAX
#      error Invalid FDCAN1 NTSEG2
#    endif
#    if FDCAN1_NSJW > FDCAN_NBTP_NSJW_MAX
#      error Invalid FDCAN1 NSJW
#    endif
#    if FDCAN1_NBRP > FDCAN_NBTP_NBRP_MAX
#      error Invalid FDCAN1 NBRP
#    endif

#    ifdef CONFIG_STM32H5_FDCAN1_FD_BRS
#      define FDCAN1_DTSEG1 (CONFIG_STM32H5_FDCAN1_DTSEG1 - 1)
#      define FDCAN1_DTSEG2 (CONFIG_STM32H5_FDCAN1_DTSEG2 - 1)
#      define FDCAN1_DBRP   ((STM32_FDCANCLK_FREQUENCY /             \
                              ((FDCAN1_DTSEG1 + FDCAN1_DTSEG2 + 3) * \
                               CONFIG_STM32H5_FDCAN1_DBITRATE)) - 1)
#      define FDCAN1_DSJW   (CONFIG_STM32H5_FDCAN1_DSJW - 1)
#    else
#      define FDCAN1_DTSEG1 1
#      define FDCAN1_DTSEG2 1
#      define FDCAN1_DBRP   1
#      define FDCAN1_DSJW   1
#    endif /* CONFIG_STM32_FDCAN1_FD_BRS */

#    if FDCAN1_DTSEG1 > FDCAN_DBTP_DTSEG1_MAX
#      error Invalid FDCAN1 DTSEG1
#    endif
#    if FDCAN1_DTSEG2 > FDCAN_DBTP_DTSEG2_MAX
#      error Invalid FDCAN1 DTSEG2
#    endif
#    if FDCAN1_DBRP > FDCAN_DBTP_DBRP_MAX
#      error Invalid FDCAN1 DBRP
#    endif
#    if FDCAN1_DSJW > FDCAN_DBTP_DSJW_MAX
#      error Invalid FDCAN1 DSJW
#    endif
#  endif

/* FDCAN1 Message RAM Configuration *****************************************/

/* FDCAN1 Message RAM Layout */

#  define FDCAN1_STDFILTER_INDEX   0
#  define FDCAN1_EXTFILTERS_INDEX  (FDCAN1_STDFILTER_INDEX + FDCAN1_STDFILTER_WORDS)
#  define FDCAN1_RXFIFO0_INDEX     (FDCAN1_EXTFILTERS_INDEX + FDCAN1_EXTFILTER_WORDS)
#  define FDCAN1_RXFIFO1_INDEX     (FDCAN1_RXFIFO0_INDEX + FDCAN1_RXFIFO0_WORDS)
#  define FDCAN1_TXEVENTFIFO_INDEX (FDCAN1_RXFIFO1_INDEX + FDCAN1_RXFIFO1_WORDS)
#  define FDCAN1_TXFIFOQ_INDEX     (FDCAN1_TXEVENTFIFO_INDEX + FDCAN1_TXEVENTFIFO_WORDS)
#  define FDCAN1_MSGRAM_WORDS      (FDCAN1_TXFIFOQ_INDEX + FDCAN1_TXFIFIOQ_WORDS)

#endif /* CONFIG_STM32H5_FDCAN1 */

/* FDCAN2 Configuration *****************************************************/

#ifdef CONFIG_STM32H5_FDCAN2

/* Bit timing */

