apache/nuttx/arch/arm/src/stm32h5/stm32_fdcan.c
      bs1 = (7 * bs1_bs2_sum - 1) / 8;
      bs2 = bs1_bs2_sum - bs1;
    }

  bool valid = (bs1 >= 1) && (bs1 <= max_bs1) && (bs2 >= 1) &&
    (bs2 <= max_bs2);

  /* Final validation
   * Helpful Python:
   * def sample_point_from_btr(x):
   *     assert 0b0011110010000000111111000000000 & x == 0
   *     ts2,ts1,brp = (x>>20)&7, (x>>16)&15, x&511
   *     return (1+ts1+1)/(1+ts1+1+ts2+1)
   */

  if (target_bitrate != (STM32_FDCANCLK_FREQUENCY /
                        (prescaler * (1 + bs1 + bs2))) || !valid)
    {
      nerr("Target bitrate invalid - solution does not match.");
      return 3; /* Solution not found */
    }

#ifdef CONFIG_STM32H5_FDCAN_REGDEBUG
  ninfo("[fdcan] CLK_FREQ %lu, target_bitrate %lu, prescaler %lu, bs1 %d"
        ", bs2 %d\n", CLK_FREQ, target_bitrate, prescaler_bs, bs1 - 1,
        bs2 - 1);
#endif

  timing->bs1 = (uint8_t)(bs1 - 1);
  timing->bs2 = (uint8_t)(bs2 - 1);
  timing->prescaler = (uint16_t)(prescaler - 1);
  timing->sjw = 0; /* Which means one */

  return 0;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_fdcaninitialize
 *
 * Description:
 *   Initialize the selected FDCAN port
 *
 * Input Parameters:
 *   port - Port number (for hardware that has multiple FDCAN interfaces),
 *          1=FDCAN1, 2=FDCAN2
 *
 * Returned Value:
 *   Valid CAN device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct can_dev_s *stm32_fdcaninitialize(int port)
{
  struct can_dev_s            *dev    = NULL;
  struct stm32_fdcan_s        *priv   = NULL;
  const struct stm32_config_s *config = NULL;
  bool auto_bit_timing                = true;
  struct fdcan_bitseg timing;

  caninfo("FDCAN%d\n", port);

  /* Select FDCAN peripheral to be initialized */

#ifdef CONFIG_STM32H5_FDCAN1
  if (port == FDCAN1)
    {
      /* Select the FDCAN1 device structure */

      dev    = &g_fdcan1dev;
      priv   = &g_fdcan1priv;
      config = &g_fdcan1const;
#ifndef CONFIG_STM32H5_FDCAN1_AUTO_BIT_TIMING
      auto_bit_timing = false;
#endif
    }
  else
#endif
#ifdef CONFIG_STM32H5_FDCAN2
  if (port == FDCAN2)
    {
      /* Select the FDCAN2 device structure */

      dev    = &g_fdcan2dev;
      priv   = &g_fdcan2priv;
      config = &g_fdcan2const;
#ifndef CONFIG_STM32H5_FDCAN2_AUTO_BIT_TIMING
      auto_bit_timing = false;
#endif
    }
  else
#endif
    {
      canerr("ERROR: Unsupported port %d\n", port);
      return NULL;
    }

  /* Perform one time data initialization */

  memset(priv, 0, sizeof(struct stm32_fdcan_s));
  priv->config = config;

  /* Set the initial bit timing.  This might change subsequently
   * due to IOCTL command processing.
   */

  if (auto_bit_timing == false)
    {
      priv->nbtp   = config->nbtp;
      priv->dbtp   = config->dbtp;
    }
  else
    {
      timing.bitrate = config->baud;
      if (fdcan_bittiming(&timing) != OK)
        {
          printf("ERROR: Invalid CAN nominal phase timings\n");
          return NULL;
        }

      priv->nbtp       = FDCAN_NBTP_NBRP(timing.prescaler) |
                         FDCAN_NBTP_NTSEG1(timing.bs1) |
                         FDCAN_NBTP_NTSEG2(timing.bs2) |
                         FDCAN_NBTP_NSJW(timing.sjw);

      if (config->mode == FDCAN_FD_BRS_MODE)
        {
          timing.bitrate = config->data_baud;
          if (fdcan_bittiming(&timing) != OK)
            {
              printf("ERROR: Invalid CAN data phase timings\n");
              return NULL;
            }

          priv->dbtp       = FDCAN_DBTP_DBRP(timing.prescaler) |
                             FDCAN_DBTP_DTSEG1(timing.bs1) |
                             FDCAN_DBTP_DTSEG2(timing.bs2) |
                             FDCAN_DBTP_DSJW(timing.sjw);
        }
      else
        {
          priv->dbtp       = 0;
        }
    }

  dev->cd_ops  = &g_fdcanops;
  dev->cd_priv = (void *)priv;

  /* And put the hardware in the initial state */

  fdcan_reset(dev);

  return dev;
}
